<a href="https://colab.research.google.com/github/Oreoluwa99/demo_test/blob/main/Ustacky_Working_with_Text_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
detail1 = {'Key 1': ['K0', 'K1', 'K2', 'K3'],
           'Key 2': ['K0', 'K1', 'K0', 'K1'],
           'name': ['Ibrahim Musa', 'Emeka Jude', 'Emmanuel Ayomide', 'Nnamdi Ike'],
           'Age': [24,25,27,24]}

In [4]:
detail2 = {'Key 1': ['K0', 'K1', 'K2', 'K3'],
           'Key 2': ['K0', 'K0', 'K0', 'K0'],
           'Course': ['Physics', 'Statistics', 'Mathematics', 'Chemistry'],
           'Sport': ['Football', 'Volleyball', 'Swimming', 'Basketball']}

In [5]:
df1 = pd.DataFrame(detail1)

In [8]:
df2 = pd.DataFrame(detail2)

In [9]:
df1

  Key 1 Key 2              name  Age
0    K0    K0      Ibrahim Musa   24
1    K1    K1        Emeka Jude   25
2    K2    K0  Emmanuel Ayomide   27
3    K3    K1        Nnamdi Ike   24

In [10]:
df2

  Key 1 Key 2       Course       Sport
0    K0    K0      Physics    Football
1    K1    K0   Statistics  Volleyball
2    K2    K0  Mathematics    Swimming
3    K3    K0    Chemistry  Basketball

In [12]:
#To merge the two tables togther, we make use of the merge function
pd.merge(df1, df2, on=('Key 1'))

  Key 1 Key 2_x              name  Age Key 2_y       Course       Sport
0    K0      K0      Ibrahim Musa   24      K0      Physics    Football
1    K1      K1        Emeka Jude   25      K0   Statistics  Volleyball
2    K2      K0  Emmanuel Ayomide   27      K0  Mathematics    Swimming
3    K3      K1        Nnamdi Ike   24      K0    Chemistry  Basketball

In [13]:
pd.merge(df1, df2, on=('Key 1', 'Key 2'))

  Key 1 Key 2              name  Age       Course     Sport
0    K0    K0      Ibrahim Musa   24      Physics  Football
1    K2    K0  Emmanuel Ayomide   27  Mathematics  Swimming

In [14]:
#Using the default how parameter inner
pd.merge(df1, df2,how='inner', on=('Key 1', 'Key 2') )

  Key 1 Key 2              name  Age       Course     Sport
0    K0    K0      Ibrahim Musa   24      Physics  Football
1    K2    K0  Emmanuel Ayomide   27  Mathematics  Swimming

In [15]:
#Using the left join method now
pd.merge(df1, df2, how='left', on=('Key 1', 'Key 2'))

  Key 1 Key 2              name  Age       Course     Sport
0    K0    K0      Ibrahim Musa   24      Physics  Football
1    K1    K1        Emeka Jude   25          NaN       NaN
2    K2    K0  Emmanuel Ayomide   27  Mathematics  Swimming
3    K3    K1        Nnamdi Ike   24          NaN       NaN

In [16]:
#Using the right join
pd.merge(df1, df2, how='right', on=('Key 1', 'Key 2'))

  Key 1 Key 2              name   Age       Course       Sport
0    K0    K0      Ibrahim Musa  24.0      Physics    Football
1    K1    K0               NaN   NaN   Statistics  Volleyball
2    K2    K0  Emmanuel Ayomide  27.0  Mathematics    Swimming
3    K3    K0               NaN   NaN    Chemistry  Basketball

In [17]:
#Using the outer join
pd.merge(df1, df2, how='outer', on=('Key 1', 'Key 2'))

  Key 1 Key 2              name   Age       Course       Sport
0    K0    K0      Ibrahim Musa  24.0      Physics    Football
1    K1    K1        Emeka Jude  25.0          NaN         NaN
2    K2    K0  Emmanuel Ayomide  27.0  Mathematics    Swimming
3    K3    K1        Nnamdi Ike  24.0          NaN         NaN
4    K1    K0               NaN   NaN   Statistics  Volleyball
5    K3    K0               NaN   NaN    Chemistry  Basketball

#Working with text data - the next topic

In [18]:
import numpy as np
import pandas as pd

In [41]:
detail1 = {'Name': ['Ibrahim Musa', 'Emeka Jude', 'Emmanuel Ayomide', 'Nnamdi Ike'],
           'Age': [24,25,27,24],
           'Course': ['Physics', 'Statistics', 'Mathematics', 'Chemistry'],
           'Sport': ['Football', 'Volleyball', 'Swiming', 'Basketball'],
           'Amount': ['$20000', '$25000', '$20000', '$20200']}

In [42]:
df = pd.DataFrame(detail1)

In [43]:
df

               Name  Age       Course       Sport  Amount
0      Ibrahim Musa   24      Physics    Football  $20000
1        Emeka Jude   25   Statistics  Volleyball  $25000
2  Emmanuel Ayomide   27  Mathematics     Swiming  $20000
3        Nnamdi Ike   24    Chemistry  Basketball  $20200

In [24]:
df['Name'].str.lower()

0        ibrahim musa
1          emeka jude
2    emmanuel ayomide
3          nnamdi ike
Name: Name, dtype: object

In [29]:
df['Name'].str.upper().str.isupper()

0    True
1    True
2    True
3    True
Name: Name, dtype: bool

In [26]:
df['Name'].str.islower()

0    False
1    False
2    False
3    False
Name: Name, dtype: bool

In [30]:
df['Name'].str.swapcase()

0        iBRAHIM mUSA
1          eMEKA jUDE
2    eMMANUEL aYOMIDE
3          nNAMDI iKE
Name: Name, dtype: object

In [31]:
df['Name'].str.len()

0    12
1    10
2    16
3    10
Name: Name, dtype: int64

In [32]:
df['Course'].str.len()

0     7
1    10
2    11
3     9
Name: Course, dtype: int64

In [37]:
df

               Name  Age       Course       Sport  Amount
0      Ibrahim Musa   24      Physics    Football   20000
1        Emeka Jude   25   Statistics  Volleyball   25000
2  Emmanuel Ayomide   27  Mathematics     Swiming   20000
3        Nnamdi Ike   24    Chemistry  Basketball   20200

In [44]:
df

               Name  Age       Course       Sport  Amount
0      Ibrahim Musa   24      Physics    Football  $20000
1        Emeka Jude   25   Statistics  Volleyball  $25000
2  Emmanuel Ayomide   27  Mathematics     Swiming  $20000
3        Nnamdi Ike   24    Chemistry  Basketball  $20200

In [45]:
df['Amount'].str.isnumeric()

0    False
1    False
2    False
3    False
Name: Amount, dtype: bool

###Splitting and Replacing
* Cat - Concatenates the series/index elements with given separator
* Split - Splits each string with the given pattern
* Replace - Replace a value with another value

In [46]:
df['Name'].str.cat(sep='_')

'Ibrahim Musa_Emeka Jude_Emmanuel Ayomide_Nnamdi Ike'

In [50]:
'I am learing nothing but Pandas'.split(' ')

['I', 'am', 'learing', 'nothing', 'but', 'Pandas']

In [51]:
df

               Name  Age       Course       Sport  Amount
0      Ibrahim Musa   24      Physics    Football  $20000
1        Emeka Jude   25   Statistics  Volleyball  $25000
2  Emmanuel Ayomide   27  Mathematics     Swiming  $20000
3        Nnamdi Ike   24    Chemistry  Basketball  $20200

In [53]:
df['Name'].str.split(' ')

0        [Ibrahim, Musa]
1          [Emeka, Jude]
2    [Emmanuel, Ayomide]
3          [Nnamdi, Ike]
Name: Name, dtype: object

In [55]:
#To get the first elements of each, we use the .get(0) method
df['Name'].str.split(' ').str.get(0)

0     Ibrahim
1       Emeka
2    Emmanuel
3      Nnamdi
Name: Name, dtype: object

In [69]:
df[['First Name', 'Last Name']] = df['Name'].str.split(' ', expand=True)
#The expand=True helps us return a Pandas dataframe

In [71]:
df.head()

               Name  Age       Course       Sport  Amount First Name Last Name
0      Ibrahim Musa   24      Physics    Football  $20000    Ibrahim      Musa
1        Emeka Jude   25   Statistics  Volleyball  $25000      Emeka      Jude
2  Emmanuel Ayomide   27  Mathematics     Swiming  $20000   Emmanuel   Ayomide
3        Nnamdi Ike   24    Chemistry  Basketball  $20200     Nnamdi       Ike

In [76]:
df['Amount'].str.replace('$', '')

0    20000
1    25000
2    20000
3    20200
Name: Amount, dtype: object

In [79]:
#The next thing to do is to convert it into a float. Then and only then can we add up the figures together

df['Amount'].str.replace('$', '').astype(float)

0    20000.0
1    25000.0
2    20000.0
3    20200.0
Name: Amount, dtype: float64

In [80]:
df['Amount'].str.replace('$', '').astype(float).sum()

85200.0

###Checking for Patterns in Data
Count - Returns count of appearance of pattern in each element
Startswith - Returns true if the element in the series starts with the pattern
Endswith - Returns true if the element in the serie ends with the pattern
Find - Returns the first position of the first occurence of the pattern
Findall - Returns a list of all occurence of the pattern

In [81]:
df

               Name  Age       Course       Sport  Amount First Name Last Name
0      Ibrahim Musa   24      Physics    Football  $20000    Ibrahim      Musa
1        Emeka Jude   25   Statistics  Volleyball  $25000      Emeka      Jude
2  Emmanuel Ayomide   27  Mathematics     Swiming  $20000   Emmanuel   Ayomide
3        Nnamdi Ike   24    Chemistry  Basketball  $20200     Nnamdi       Ike

In [83]:
df['Name'].str.lower().str.count('e')

0    0
1    3
2    3
3    1
Name: Name, dtype: int64

In [84]:
df['Name'].str.lower().str.startswith('e')

0    False
1     True
2     True
3    False
Name: Name, dtype: bool